Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.AccessControlListUpdate
Access control update information.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.AccessControlListUpdate.AddOrUpdate
Gets or sets the access control objects to add or update.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.AccessControlListUpdate.Remove
Gets or sets the principal identifiers to remove.